<?php
/**
 * User: redhujiao
 * Date: 2019/4/9
 * Time: 12:07
 */

namespace app\api\model;


use think\Model;

class BarCode2 extends Model
{
    protected $hidden=['id','编号','简码','最高限量','最低限量','批发价','零售价','主治',
        '分类','生产批号','供应商','注册商标','合格证','批发指导价1',
        '批发指导价2','批发指导价3','批发指导价4','柜组','处方属性','产地','许可证号',
        '促销开始','促销结束','是否促销','是否医保','是否隐藏','促销价','会员价',
        '别名','最高限价','提成','数据来源','通用名','厂家全称','拆零单位','拆零数量'
    ,'服务器序号','ypid','通用名简码','厂家简码','重点养护','拆零规格','拆零价',
        '是否进口','是否处方','是否赠品','兑换积分','广州编码','等级','五笔码',
        '是否积分','参与积分','电子监管码','麻黄碱','特殊专管','是否非药品',
        '不参加打折','DZWJM','是否审核','储存条件'];
    public static function getDrug($id){
        return self::get(['BarCode'=>$id]);
    }

}